Revit 2027 API
ParameterTypeId.FamilyRotateWithComponent Property
 "Rotate with component"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyRotateWithComponent { get; }
Public Shared ReadOnly Property FamilyRotateWithComponent As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyRotateWithComponent {
	ForgeTypeId^ get ();
}
static member FamilyRotateWithComponent : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace